benchmark_report/wrk_results_9594/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.99ms  235.74ms   1.83s    95.61%
    Req/Sec     0.93k    92.01     1.20k    80.95%
  Latency Distribution
     50%    8.58ms
     75%    9.62ms
     90%   11.06ms
     99%    1.49s 
  335759 requests in 31.92s, 30.74MB read
Requests/sec:  10519.00
Transfer/sec:      0.96MB