benchmark_report/wrk_results_9594/wrk_200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   133.86ms  281.47ms   1.87s    86.26%
    Req/Sec     0.95k   193.30     1.67k    70.43%
  Latency Distribution
     50%   12.03ms
     75%   14.54ms
     90%  603.35ms
     99%    1.14s 
  341760 requests in 31.71s, 31.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 135
Requests/sec:  10776.11
Transfer/sec:      0.99MB