benchmark_report/wrk_results_9594/wrk_400concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.81ms  326.75ms   1.91s    82.75%
    Req/Sec     0.93k   269.05     2.01k    70.29%
  Latency Distribution
     50%   12.63ms
     75%  252.78ms
     90%  769.41ms
     99%    1.21s 
  336340 requests in 31.85s, 30.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 961
Requests/sec:  10561.72
Transfer/sec:      0.97MB