benchmark_report/wrk_results_9594/wrk_600concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   184.83ms  334.96ms   1.91s    83.88%
    Req/Sec     0.92k   309.39     2.72k    71.36%
  Latency Distribution
     50%   12.70ms
     75%  186.72ms
     90%  768.33ms
     99%    1.28s 
  222311 requests in 22.01s, 20.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 1514
Requests/sec:  10100.42
Transfer/sec:      0.92MB